espressif/esp-idf/components/soc/esp32s31/register/soc/hp_peri1_pms_struct.h
/**
 * SPDX-FileCopyrightText: 2025 Espressif Systems (Shanghai) CO LTD
 *
 *  SPDX-License-Identifier: Apache-2.0
 */
#pragma once

#include <stdint.h>
#ifdef __cplusplus
extern "C" {
#endif

/** Group: read write control register */
/** Type of hp_usbotg_phy_ctrl register
 *  hp_usbotg_phy read/write control register
 */
typedef union {
    struct {
        /** read_tee_hp_usbotg_phy : R/W; bitpos: [0]; default: 1;
         *  Configures hp_usbotg_phy registers read permission in tee mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_tee_hp_usbotg_phy:1;
        /** read_ree0_hp_usbotg_phy : R/W; bitpos: [1]; default: 0;
         *  Configures hp_usbotg_phy registers read permission in ree0 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree0_hp_usbotg_phy:1;
        /** read_ree1_hp_usbotg_phy : R/W; bitpos: [2]; default: 0;
         *  Configures hp_usbotg_phy registers read permission in ree1 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree1_hp_usbotg_phy:1;
        /** read_ree2_hp_usbotg_phy : R/W; bitpos: [3]; default: 0;
         *  Configures hp_usbotg_phy registers read permission in ree2 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree2_hp_usbotg_phy:1;
        /** write_tee_hp_usbotg_phy : R/W; bitpos: [4]; default: 1;
         *  Configures hp_usbotg_phy registers write permission in tee mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_tee_hp_usbotg_phy:1;
        /** write_ree0_hp_usbotg_phy : R/W; bitpos: [5]; default: 0;
         *  Configures hp_usbotg_phy registers write permission in ree0 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree0_hp_usbotg_phy:1;
        /** write_ree1_hp_usbotg_phy : R/W; bitpos: [6]; default: 0;
         *  Configures hp_usbotg_phy registers write permission in ree1 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree1_hp_usbotg_phy:1;
        /** write_ree2_hp_usbotg_phy : R/W; bitpos: [7]; default: 0;
         *  Configures hp_usbotg_phy registers write permission in ree2 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree2_hp_usbotg_phy:1;
        /** hp_usbotg_phy_lock : R/W; bitpos: [8]; default: 0;
         *  Set 1 to lock hp_usbotg_phy peri_apm configuration
         */
        uint32_t hp_usbotg_phy_lock:1;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} hp_peri1_pms_hp_usbotg_phy_ctrl_reg_t;

/** Type of hp_mcpwm0_ctrl register
 *  hp_mcpwm0 read/write control register
 */
typedef union {
    struct {
        /** read_tee_hp_mcpwm0 : R/W; bitpos: [0]; default: 1;
         *  Configures hp_mcpwm0 registers read permission in tee mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_tee_hp_mcpwm0:1;
        /** read_ree0_hp_mcpwm0 : R/W; bitpos: [1]; default: 0;
         *  Configures hp_mcpwm0 registers read permission in ree0 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree0_hp_mcpwm0:1;
        /** read_ree1_hp_mcpwm0 : R/W; bitpos: [2]; default: 0;
         *  Configures hp_mcpwm0 registers read permission in ree1 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree1_hp_mcpwm0:1;
        /** read_ree2_hp_mcpwm0 : R/W; bitpos: [3]; default: 0;
         *  Configures hp_mcpwm0 registers read permission in ree2 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree2_hp_mcpwm0:1;
        /** write_tee_hp_mcpwm0 : R/W; bitpos: [4]; default: 1;
         *  Configures hp_mcpwm0 registers write permission in tee mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_tee_hp_mcpwm0:1;
        /** write_ree0_hp_mcpwm0 : R/W; bitpos: [5]; default: 0;
         *  Configures hp_mcpwm0 registers write permission in ree0 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree0_hp_mcpwm0:1;
        /** write_ree1_hp_mcpwm0 : R/W; bitpos: [6]; default: 0;
         *  Configures hp_mcpwm0 registers write permission in ree1 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree1_hp_mcpwm0:1;
        /** write_ree2_hp_mcpwm0 : R/W; bitpos: [7]; default: 0;
         *  Configures hp_mcpwm0 registers write permission in ree2 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree2_hp_mcpwm0:1;
        /** hp_mcpwm0_lock : R/W; bitpos: [8]; default: 0;
         *  Set 1 to lock hp_mcpwm0 peri_apm configuration
         */
        uint32_t hp_mcpwm0_lock:1;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} hp_peri1_pms_hp_mcpwm0_ctrl_reg_t;

/** Type of hp_mcpwm1_ctrl register
 *  hp_mcpwm1 read/write control register
 */
typedef union {
    struct {
        /** read_tee_hp_mcpwm1 : R/W; bitpos: [0]; default: 1;
         *  Configures hp_mcpwm1 registers read permission in tee mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_tee_hp_mcpwm1:1;
        /** read_ree0_hp_mcpwm1 : R/W; bitpos: [1]; default: 0;
         *  Configures hp_mcpwm1 registers read permission in ree0 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree0_hp_mcpwm1:1;
        /** read_ree1_hp_mcpwm1 : R/W; bitpos: [2]; default: 0;
         *  Configures hp_mcpwm1 registers read permission in ree1 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree1_hp_mcpwm1:1;
        /** read_ree2_hp_mcpwm1 : R/W; bitpos: [3]; default: 0;
         *  Configures hp_mcpwm1 registers read permission in ree2 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree2_hp_mcpwm1:1;
        /** write_tee_hp_mcpwm1 : R/W; bitpos: [4]; default: 1;
         *  Configures hp_mcpwm1 registers write permission in tee mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_tee_hp_mcpwm1:1;
        /** write_ree0_hp_mcpwm1 : R/W; bitpos: [5]; default: 0;
         *  Configures hp_mcpwm1 registers write permission in ree0 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree0_hp_mcpwm1:1;
        /** write_ree1_hp_mcpwm1 : R/W; bitpos: [6]; default: 0;
         *  Configures hp_mcpwm1 registers write permission in ree1 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree1_hp_mcpwm1:1;
        /** write_ree2_hp_mcpwm1 : R/W; bitpos: [7]; default: 0;
         *  Configures hp_mcpwm1 registers write permission in ree2 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree2_hp_mcpwm1:1;
        /** hp_mcpwm1_lock : R/W; bitpos: [8]; default: 0;
         *  Set 1 to lock hp_mcpwm1 peri_apm configuration
         */
        uint32_t hp_mcpwm1_lock:1;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} hp_peri1_pms_hp_mcpwm1_ctrl_reg_t;

/** Type of hp_mcpwm2_ctrl register
 *  hp_mcpwm2 read/write control register
 */
typedef union {
    struct {
        /** read_tee_hp_mcpwm2 : R/W; bitpos: [0]; default: 1;
         *  Configures hp_mcpwm2 registers read permission in tee mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_tee_hp_mcpwm2:1;
        /** read_ree0_hp_mcpwm2 : R/W; bitpos: [1]; default: 0;
         *  Configures hp_mcpwm2 registers read permission in ree0 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree0_hp_mcpwm2:1;
        /** read_ree1_hp_mcpwm2 : R/W; bitpos: [2]; default: 0;
         *  Configures hp_mcpwm2 registers read permission in ree1 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree1_hp_mcpwm2:1;
        /** read_ree2_hp_mcpwm2 : R/W; bitpos: [3]; default: 0;
         *  Configures hp_mcpwm2 registers read permission in ree2 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree2_hp_mcpwm2:1;
        /** write_tee_hp_mcpwm2 : R/W; bitpos: [4]; default: 1;
         *  Configures hp_mcpwm2 registers write permission in tee mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_tee_hp_mcpwm2:1;
        /** write_ree0_hp_mcpwm2 : R/W; bitpos: [5]; default: 0;
         *  Configures hp_mcpwm2 registers write permission in ree0 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree0_hp_mcpwm2:1;
        /** write_ree1_hp_mcpwm2 : R/W; bitpos: [6]; default: 0;
         *  Configures hp_mcpwm2 registers write permission in ree1 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree1_hp_mcpwm2:1;
        /** write_ree2_hp_mcpwm2 : R/W; bitpos: [7]; default: 0;
         *  Configures hp_mcpwm2 registers write permission in ree2 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree2_hp_mcpwm2:1;
        /** hp_mcpwm2_lock : R/W; bitpos: [8]; default: 0;
         *  Set 1 to lock hp_mcpwm2 peri_apm configuration
         */
        uint32_t hp_mcpwm2_lock:1;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} hp_peri1_pms_hp_mcpwm2_ctrl_reg_t;

/** Type of hp_mcpwm3_ctrl register
 *  hp_mcpwm3 read/write control register
 */
typedef union {
    struct {
        /** read_tee_hp_mcpwm3 : R/W; bitpos: [0]; default: 1;
         *  Configures hp_mcpwm3 registers read permission in tee mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_tee_hp_mcpwm3:1;
        /** read_ree0_hp_mcpwm3 : R/W; bitpos: [1]; default: 0;
         *  Configures hp_mcpwm3 registers read permission in ree0 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree0_hp_mcpwm3:1;
        /** read_ree1_hp_mcpwm3 : R/W; bitpos: [2]; default: 0;
         *  Configures hp_mcpwm3 registers read permission in ree1 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree1_hp_mcpwm3:1;
        /** read_ree2_hp_mcpwm3 : R/W; bitpos: [3]; default: 0;
         *  Configures hp_mcpwm3 registers read permission in ree2 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree2_hp_mcpwm3:1;
        /** write_tee_hp_mcpwm3 : R/W; bitpos: [4]; default: 1;
         *  Configures hp_mcpwm3 registers write permission in tee mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_tee_hp_mcpwm3:1;
        /** write_ree0_hp_mcpwm3 : R/W; bitpos: [5]; default: 0;
         *  Configures hp_mcpwm3 registers write permission in ree0 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree0_hp_mcpwm3:1;
        /** write_ree1_hp_mcpwm3 : R/W; bitpos: [6]; default: 0;
         *  Configures hp_mcpwm3 registers write permission in ree1 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree1_hp_mcpwm3:1;
        /** write_ree2_hp_mcpwm3 : R/W; bitpos: [7]; default: 0;
         *  Configures hp_mcpwm3 registers write permission in ree2 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree2_hp_mcpwm3:1;
        /** hp_mcpwm3_lock : R/W; bitpos: [8]; default: 0;
         *  Set 1 to lock hp_mcpwm3 peri_apm configuration
         */
        uint32_t hp_mcpwm3_lock:1;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} hp_peri1_pms_hp_mcpwm3_ctrl_reg_t;

