espressif/esp-idf/components/soc/esp32s31/register/soc/hp_peri1_pms_struct.h
/** Type of hp_i2c0_ctrl register
 *  hp_i2c0 read/write control register
 */
typedef union {
    struct {
        /** read_tee_hp_i2c0 : R/W; bitpos: [0]; default: 1;
         *  Configures hp_i2c0 registers read permission in tee mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_tee_hp_i2c0:1;
        /** read_ree0_hp_i2c0 : R/W; bitpos: [1]; default: 0;
         *  Configures hp_i2c0 registers read permission in ree0 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree0_hp_i2c0:1;
        /** read_ree1_hp_i2c0 : R/W; bitpos: [2]; default: 0;
         *  Configures hp_i2c0 registers read permission in ree1 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree1_hp_i2c0:1;
        /** read_ree2_hp_i2c0 : R/W; bitpos: [3]; default: 0;
         *  Configures hp_i2c0 registers read permission in ree2 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree2_hp_i2c0:1;
        /** write_tee_hp_i2c0 : R/W; bitpos: [4]; default: 1;
         *  Configures hp_i2c0 registers write permission in tee mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_tee_hp_i2c0:1;
        /** write_ree0_hp_i2c0 : R/W; bitpos: [5]; default: 0;
         *  Configures hp_i2c0 registers write permission in ree0 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree0_hp_i2c0:1;
        /** write_ree1_hp_i2c0 : R/W; bitpos: [6]; default: 0;
         *  Configures hp_i2c0 registers write permission in ree1 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree1_hp_i2c0:1;
        /** write_ree2_hp_i2c0 : R/W; bitpos: [7]; default: 0;
         *  Configures hp_i2c0 registers write permission in ree2 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree2_hp_i2c0:1;
        /** hp_i2c0_lock : R/W; bitpos: [8]; default: 0;
         *  Set 1 to lock hp_i2c0 peri_apm configuration
         */
        uint32_t hp_i2c0_lock:1;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} hp_peri1_pms_hp_i2c0_ctrl_reg_t;

/** Type of hp_i2c1_ctrl register
 *  hp_i2c1 read/write control register
 */
typedef union {
    struct {
        /** read_tee_hp_i2c1 : R/W; bitpos: [0]; default: 1;
         *  Configures hp_i2c1 registers read permission in tee mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_tee_hp_i2c1:1;
        /** read_ree0_hp_i2c1 : R/W; bitpos: [1]; default: 0;
         *  Configures hp_i2c1 registers read permission in ree0 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree0_hp_i2c1:1;
        /** read_ree1_hp_i2c1 : R/W; bitpos: [2]; default: 0;
         *  Configures hp_i2c1 registers read permission in ree1 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree1_hp_i2c1:1;
        /** read_ree2_hp_i2c1 : R/W; bitpos: [3]; default: 0;
         *  Configures hp_i2c1 registers read permission in ree2 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree2_hp_i2c1:1;
        /** write_tee_hp_i2c1 : R/W; bitpos: [4]; default: 1;
         *  Configures hp_i2c1 registers write permission in tee mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_tee_hp_i2c1:1;
        /** write_ree0_hp_i2c1 : R/W; bitpos: [5]; default: 0;
         *  Configures hp_i2c1 registers write permission in ree0 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree0_hp_i2c1:1;
        /** write_ree1_hp_i2c1 : R/W; bitpos: [6]; default: 0;
         *  Configures hp_i2c1 registers write permission in ree1 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree1_hp_i2c1:1;
        /** write_ree2_hp_i2c1 : R/W; bitpos: [7]; default: 0;
         *  Configures hp_i2c1 registers write permission in ree2 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree2_hp_i2c1:1;
        /** hp_i2c1_lock : R/W; bitpos: [8]; default: 0;
         *  Set 1 to lock hp_i2c1 peri_apm configuration
         */
        uint32_t hp_i2c1_lock:1;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} hp_peri1_pms_hp_i2c1_ctrl_reg_t;

/** Type of hp_i2s0_ctrl register
 *  hp_i2s0 read/write control register
 */
typedef union {
    struct {
        /** read_tee_hp_i2s0 : R/W; bitpos: [0]; default: 1;
         *  Configures hp_i2s0 registers read permission in tee mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_tee_hp_i2s0:1;
        /** read_ree0_hp_i2s0 : R/W; bitpos: [1]; default: 0;
         *  Configures hp_i2s0 registers read permission in ree0 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree0_hp_i2s0:1;
        /** read_ree1_hp_i2s0 : R/W; bitpos: [2]; default: 0;
         *  Configures hp_i2s0 registers read permission in ree1 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree1_hp_i2s0:1;
        /** read_ree2_hp_i2s0 : R/W; bitpos: [3]; default: 0;
         *  Configures hp_i2s0 registers read permission in ree2 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree2_hp_i2s0:1;
        /** write_tee_hp_i2s0 : R/W; bitpos: [4]; default: 1;
         *  Configures hp_i2s0 registers write permission in tee mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_tee_hp_i2s0:1;
        /** write_ree0_hp_i2s0 : R/W; bitpos: [5]; default: 0;
         *  Configures hp_i2s0 registers write permission in ree0 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree0_hp_i2s0:1;
        /** write_ree1_hp_i2s0 : R/W; bitpos: [6]; default: 0;
         *  Configures hp_i2s0 registers write permission in ree1 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree1_hp_i2s0:1;
        /** write_ree2_hp_i2s0 : R/W; bitpos: [7]; default: 0;
         *  Configures hp_i2s0 registers write permission in ree2 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree2_hp_i2s0:1;
        /** hp_i2s0_lock : R/W; bitpos: [8]; default: 0;
         *  Set 1 to lock hp_i2s0 peri_apm configuration
         */
        uint32_t hp_i2s0_lock:1;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} hp_peri1_pms_hp_i2s0_ctrl_reg_t;

/** Type of hp_i2s1_ctrl register
 *  hp_i2s1 read/write control register
 */
typedef union {
    struct {
        /** read_tee_hp_i2s1 : R/W; bitpos: [0]; default: 1;
         *  Configures hp_i2s1 registers read permission in tee mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_tee_hp_i2s1:1;
        /** read_ree0_hp_i2s1 : R/W; bitpos: [1]; default: 0;
         *  Configures hp_i2s1 registers read permission in ree0 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree0_hp_i2s1:1;
        /** read_ree1_hp_i2s1 : R/W; bitpos: [2]; default: 0;
         *  Configures hp_i2s1 registers read permission in ree1 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree1_hp_i2s1:1;
        /** read_ree2_hp_i2s1 : R/W; bitpos: [3]; default: 0;
         *  Configures hp_i2s1 registers read permission in ree2 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree2_hp_i2s1:1;
        /** write_tee_hp_i2s1 : R/W; bitpos: [4]; default: 1;
         *  Configures hp_i2s1 registers write permission in tee mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_tee_hp_i2s1:1;
        /** write_ree0_hp_i2s1 : R/W; bitpos: [5]; default: 0;
         *  Configures hp_i2s1 registers write permission in ree0 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree0_hp_i2s1:1;
        /** write_ree1_hp_i2s1 : R/W; bitpos: [6]; default: 0;
         *  Configures hp_i2s1 registers write permission in ree1 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree1_hp_i2s1:1;
        /** write_ree2_hp_i2s1 : R/W; bitpos: [7]; default: 0;
         *  Configures hp_i2s1 registers write permission in ree2 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree2_hp_i2s1:1;
        /** hp_i2s1_lock : R/W; bitpos: [8]; default: 0;
         *  Set 1 to lock hp_i2s1 peri_apm configuration
         */
        uint32_t hp_i2s1_lock:1;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} hp_peri1_pms_hp_i2s1_ctrl_reg_t;

/** Type of hp_pcnt0_ctrl register
 *  hp_pcnt0 read/write control register
 */
typedef union {
    struct {
        /** read_tee_hp_pcnt0 : R/W; bitpos: [0]; default: 1;
         *  Configures hp_pcnt0 registers read permission in tee mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_tee_hp_pcnt0:1;
        /** read_ree0_hp_pcnt0 : R/W; bitpos: [1]; default: 0;
         *  Configures hp_pcnt0 registers read permission in ree0 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree0_hp_pcnt0:1;
        /** read_ree1_hp_pcnt0 : R/W; bitpos: [2]; default: 0;
         *  Configures hp_pcnt0 registers read permission in ree1 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree1_hp_pcnt0:1;
        /** read_ree2_hp_pcnt0 : R/W; bitpos: [3]; default: 0;
         *  Configures hp_pcnt0 registers read permission in ree2 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree2_hp_pcnt0:1;
        /** write_tee_hp_pcnt0 : R/W; bitpos: [4]; default: 1;
         *  Configures hp_pcnt0 registers write permission in tee mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_tee_hp_pcnt0:1;
        /** write_ree0_hp_pcnt0 : R/W; bitpos: [5]; default: 0;
         *  Configures hp_pcnt0 registers write permission in ree0 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree0_hp_pcnt0:1;
        /** write_ree1_hp_pcnt0 : R/W; bitpos: [6]; default: 0;
         *  Configures hp_pcnt0 registers write permission in ree1 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree1_hp_pcnt0:1;
        /** write_ree2_hp_pcnt0 : R/W; bitpos: [7]; default: 0;
         *  Configures hp_pcnt0 registers write permission in ree2 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree2_hp_pcnt0:1;
        /** hp_pcnt0_lock : R/W; bitpos: [8]; default: 0;
         *  Set 1 to lock hp_pcnt0 peri_apm configuration
         */
        uint32_t hp_pcnt0_lock:1;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} hp_peri1_pms_hp_pcnt0_ctrl_reg_t;

/** Type of hp_uart0_ctrl register
 *  hp_uart0 read/write control register
 */
typedef union {
    struct {
        /** read_tee_hp_uart0 : R/W; bitpos: [0]; default: 1;
         *  Configures hp_uart0 registers read permission in tee mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_tee_hp_uart0:1;
        /** read_ree0_hp_uart0 : R/W; bitpos: [1]; default: 0;
         *  Configures hp_uart0 registers read permission in ree0 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree0_hp_uart0:1;
        /** read_ree1_hp_uart0 : R/W; bitpos: [2]; default: 0;
         *  Configures hp_uart0 registers read permission in ree1 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree1_hp_uart0:1;
        /** read_ree2_hp_uart0 : R/W; bitpos: [3]; default: 0;
         *  Configures hp_uart0 registers read permission in ree2 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree2_hp_uart0:1;
        /** write_tee_hp_uart0 : R/W; bitpos: [4]; default: 1;
         *  Configures hp_uart0 registers write permission in tee mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_tee_hp_uart0:1;
        /** write_ree0_hp_uart0 : R/W; bitpos: [5]; default: 0;
         *  Configures hp_uart0 registers write permission in ree0 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree0_hp_uart0:1;
        /** write_ree1_hp_uart0 : R/W; bitpos: [6]; default: 0;
         *  Configures hp_uart0 registers write permission in ree1 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree1_hp_uart0:1;
        /** write_ree2_hp_uart0 : R/W; bitpos: [7]; default: 0;
         *  Configures hp_uart0 registers write permission in ree2 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree2_hp_uart0:1;
        /** hp_uart0_lock : R/W; bitpos: [8]; default: 0;
         *  Set 1 to lock hp_uart0 peri_apm configuration
         */
        uint32_t hp_uart0_lock:1;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} hp_peri1_pms_hp_uart0_ctrl_reg_t;

/** Type of hp_uart1_ctrl register
 *  hp_uart1 read/write control register
 */
typedef union {
    struct {
        /** read_tee_hp_uart1 : R/W; bitpos: [0]; default: 1;
         *  Configures hp_uart1 registers read permission in tee mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_tee_hp_uart1:1;
        /** read_ree0_hp_uart1 : R/W; bitpos: [1]; default: 0;
         *  Configures hp_uart1 registers read permission in ree0 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree0_hp_uart1:1;
        /** read_ree1_hp_uart1 : R/W; bitpos: [2]; default: 0;
         *  Configures hp_uart1 registers read permission in ree1 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree1_hp_uart1:1;
        /** read_ree2_hp_uart1 : R/W; bitpos: [3]; default: 0;
         *  Configures hp_uart1 registers read permission in ree2 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree2_hp_uart1:1;
        /** write_tee_hp_uart1 : R/W; bitpos: [4]; default: 1;
         *  Configures hp_uart1 registers write permission in tee mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_tee_hp_uart1:1;
        /** write_ree0_hp_uart1 : R/W; bitpos: [5]; default: 0;
         *  Configures hp_uart1 registers write permission in ree0 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree0_hp_uart1:1;
        /** write_ree1_hp_uart1 : R/W; bitpos: [6]; default: 0;
         *  Configures hp_uart1 registers write permission in ree1 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree1_hp_uart1:1;
        /** write_ree2_hp_uart1 : R/W; bitpos: [7]; default: 0;
         *  Configures hp_uart1 registers write permission in ree2 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree2_hp_uart1:1;
        /** hp_uart1_lock : R/W; bitpos: [8]; default: 0;
         *  Set 1 to lock hp_uart1 peri_apm configuration
         */
        uint32_t hp_uart1_lock:1;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} hp_peri1_pms_hp_uart1_ctrl_reg_t;

/** Type of hp_uart2_ctrl register
 *  hp_uart2 read/write control register
 */
typedef union {
    struct {
        /** read_tee_hp_uart2 : R/W; bitpos: [0]; default: 1;
         *  Configures hp_uart2 registers read permission in tee mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_tee_hp_uart2:1;
        /** read_ree0_hp_uart2 : R/W; bitpos: [1]; default: 0;
         *  Configures hp_uart2 registers read permission in ree0 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree0_hp_uart2:1;
        /** read_ree1_hp_uart2 : R/W; bitpos: [2]; default: 0;
         *  Configures hp_uart2 registers read permission in ree1 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree1_hp_uart2:1;
        /** read_ree2_hp_uart2 : R/W; bitpos: [3]; default: 0;
         *  Configures hp_uart2 registers read permission in ree2 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree2_hp_uart2:1;
        /** write_tee_hp_uart2 : R/W; bitpos: [4]; default: 1;
         *  Configures hp_uart2 registers write permission in tee mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_tee_hp_uart2:1;
        /** write_ree0_hp_uart2 : R/W; bitpos: [5]; default: 0;
         *  Configures hp_uart2 registers write permission in ree0 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree0_hp_uart2:1;
        /** write_ree1_hp_uart2 : R/W; bitpos: [6]; default: 0;
         *  Configures hp_uart2 registers write permission in ree1 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree1_hp_uart2:1;
        /** write_ree2_hp_uart2 : R/W; bitpos: [7]; default: 0;
         *  Configures hp_uart2 registers write permission in ree2 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree2_hp_uart2:1;
        /** hp_uart2_lock : R/W; bitpos: [8]; default: 0;
         *  Set 1 to lock hp_uart2 peri_apm configuration
         */
        uint32_t hp_uart2_lock:1;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} hp_peri1_pms_hp_uart2_ctrl_reg_t;

/** Type of hp_uart3_ctrl register
 *  hp_uart3 read/write control register
 */
typedef union {
    struct {
        /** read_tee_hp_uart3 : R/W; bitpos: [0]; default: 1;
         *  Configures hp_uart3 registers read permission in tee mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_tee_hp_uart3:1;
        /** read_ree0_hp_uart3 : R/W; bitpos: [1]; default: 0;
         *  Configures hp_uart3 registers read permission in ree0 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree0_hp_uart3:1;
        /** read_ree1_hp_uart3 : R/W; bitpos: [2]; default: 0;
         *  Configures hp_uart3 registers read permission in ree1 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree1_hp_uart3:1;
        /** read_ree2_hp_uart3 : R/W; bitpos: [3]; default: 0;
         *  Configures hp_uart3 registers read permission in ree2 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree2_hp_uart3:1;
        /** write_tee_hp_uart3 : R/W; bitpos: [4]; default: 1;
         *  Configures hp_uart3 registers write permission in tee mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_tee_hp_uart3:1;
        /** write_ree0_hp_uart3 : R/W; bitpos: [5]; default: 0;
         *  Configures hp_uart3 registers write permission in ree0 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree0_hp_uart3:1;
        /** write_ree1_hp_uart3 : R/W; bitpos: [6]; default: 0;
         *  Configures hp_uart3 registers write permission in ree1 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree1_hp_uart3:1;
        /** write_ree2_hp_uart3 : R/W; bitpos: [7]; default: 0;
         *  Configures hp_uart3 registers write permission in ree2 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree2_hp_uart3:1;
        /** hp_uart3_lock : R/W; bitpos: [8]; default: 0;
         *  Set 1 to lock hp_uart3 peri_apm configuration
         */
        uint32_t hp_uart3_lock:1;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} hp_peri1_pms_hp_uart3_ctrl_reg_t;

/** Type of hp_parlio_ctrl register
 *  hp_parlio read/write control register
 */
typedef union {
    struct {
        /** read_tee_hp_parlio : R/W; bitpos: [0]; default: 1;
         *  Configures hp_parlio registers read permission in tee mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_tee_hp_parlio:1;
        /** read_ree0_hp_parlio : R/W; bitpos: [1]; default: 0;
         *  Configures hp_parlio registers read permission in ree0 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree0_hp_parlio:1;
        /** read_ree1_hp_parlio : R/W; bitpos: [2]; default: 0;
         *  Configures hp_parlio registers read permission in ree1 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree1_hp_parlio:1;
        /** read_ree2_hp_parlio : R/W; bitpos: [3]; default: 0;
         *  Configures hp_parlio registers read permission in ree2 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree2_hp_parlio:1;
        /** write_tee_hp_parlio : R/W; bitpos: [4]; default: 1;
         *  Configures hp_parlio registers write permission in tee mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_tee_hp_parlio:1;
        /** write_ree0_hp_parlio : R/W; bitpos: [5]; default: 0;
         *  Configures hp_parlio registers write permission in ree0 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree0_hp_parlio:1;
        /** write_ree1_hp_parlio : R/W; bitpos: [6]; default: 0;
         *  Configures hp_parlio registers write permission in ree1 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree1_hp_parlio:1;
        /** write_ree2_hp_parlio : R/W; bitpos: [7]; default: 0;
         *  Configures hp_parlio registers write permission in ree2 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree2_hp_parlio:1;
        /** hp_parlio_lock : R/W; bitpos: [8]; default: 0;
         *  Set 1 to lock hp_parlio peri_apm configuration
         */
        uint32_t hp_parlio_lock:1;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} hp_peri1_pms_hp_parlio_ctrl_reg_t;

