espressif/esp-idf/components/soc/esp32s31/register/soc/hp_peri1_pms_struct.h
/** Type of hp_gpspi2_ctrl register
 *  hp_gpspi2 read/write control register
 */
typedef union {
    struct {
        /** read_tee_hp_gpspi2 : R/W; bitpos: [0]; default: 1;
         *  Configures hp_gpspi2 registers read permission in tee mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_tee_hp_gpspi2:1;
        /** read_ree0_hp_gpspi2 : R/W; bitpos: [1]; default: 0;
         *  Configures hp_gpspi2 registers read permission in ree0 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree0_hp_gpspi2:1;
        /** read_ree1_hp_gpspi2 : R/W; bitpos: [2]; default: 0;
         *  Configures hp_gpspi2 registers read permission in ree1 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree1_hp_gpspi2:1;
        /** read_ree2_hp_gpspi2 : R/W; bitpos: [3]; default: 0;
         *  Configures hp_gpspi2 registers read permission in ree2 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree2_hp_gpspi2:1;
        /** write_tee_hp_gpspi2 : R/W; bitpos: [4]; default: 1;
         *  Configures hp_gpspi2 registers write permission in tee mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_tee_hp_gpspi2:1;
        /** write_ree0_hp_gpspi2 : R/W; bitpos: [5]; default: 0;
         *  Configures hp_gpspi2 registers write permission in ree0 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree0_hp_gpspi2:1;
        /** write_ree1_hp_gpspi2 : R/W; bitpos: [6]; default: 0;
         *  Configures hp_gpspi2 registers write permission in ree1 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree1_hp_gpspi2:1;
        /** write_ree2_hp_gpspi2 : R/W; bitpos: [7]; default: 0;
         *  Configures hp_gpspi2 registers write permission in ree2 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree2_hp_gpspi2:1;
        /** hp_gpspi2_lock : R/W; bitpos: [8]; default: 0;
         *  Set 1 to lock hp_gpspi2 peri_apm configuration
         */
        uint32_t hp_gpspi2_lock:1;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} hp_peri1_pms_hp_gpspi2_ctrl_reg_t;

/** Type of hp_gpspi3_ctrl register
 *  hp_gpspi3 read/write control register
 */
typedef union {
    struct {
        /** read_tee_hp_gpspi3 : R/W; bitpos: [0]; default: 1;
         *  Configures hp_gpspi3 registers read permission in tee mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_tee_hp_gpspi3:1;
        /** read_ree0_hp_gpspi3 : R/W; bitpos: [1]; default: 0;
         *  Configures hp_gpspi3 registers read permission in ree0 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree0_hp_gpspi3:1;
        /** read_ree1_hp_gpspi3 : R/W; bitpos: [2]; default: 0;
         *  Configures hp_gpspi3 registers read permission in ree1 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree1_hp_gpspi3:1;
        /** read_ree2_hp_gpspi3 : R/W; bitpos: [3]; default: 0;
         *  Configures hp_gpspi3 registers read permission in ree2 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree2_hp_gpspi3:1;
        /** write_tee_hp_gpspi3 : R/W; bitpos: [4]; default: 1;
         *  Configures hp_gpspi3 registers write permission in tee mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_tee_hp_gpspi3:1;
        /** write_ree0_hp_gpspi3 : R/W; bitpos: [5]; default: 0;
         *  Configures hp_gpspi3 registers write permission in ree0 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree0_hp_gpspi3:1;
        /** write_ree1_hp_gpspi3 : R/W; bitpos: [6]; default: 0;
         *  Configures hp_gpspi3 registers write permission in ree1 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree1_hp_gpspi3:1;
        /** write_ree2_hp_gpspi3 : R/W; bitpos: [7]; default: 0;
         *  Configures hp_gpspi3 registers write permission in ree2 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree2_hp_gpspi3:1;
        /** hp_gpspi3_lock : R/W; bitpos: [8]; default: 0;
         *  Set 1 to lock hp_gpspi3 peri_apm configuration
         */
        uint32_t hp_gpspi3_lock:1;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} hp_peri1_pms_hp_gpspi3_ctrl_reg_t;

/** Type of hp_usbdevice_ctrl register
 *  hp_usbdevice read/write control register
 */
typedef union {
    struct {
        /** read_tee_hp_usbdevice : R/W; bitpos: [0]; default: 1;
         *  Configures hp_usbdevice registers read permission in tee mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_tee_hp_usbdevice:1;
        /** read_ree0_hp_usbdevice : R/W; bitpos: [1]; default: 0;
         *  Configures hp_usbdevice registers read permission in ree0 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree0_hp_usbdevice:1;
        /** read_ree1_hp_usbdevice : R/W; bitpos: [2]; default: 0;
         *  Configures hp_usbdevice registers read permission in ree1 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree1_hp_usbdevice:1;
        /** read_ree2_hp_usbdevice : R/W; bitpos: [3]; default: 0;
         *  Configures hp_usbdevice registers read permission in ree2 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree2_hp_usbdevice:1;
        /** write_tee_hp_usbdevice : R/W; bitpos: [4]; default: 1;
         *  Configures hp_usbdevice registers write permission in tee mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_tee_hp_usbdevice:1;
        /** write_ree0_hp_usbdevice : R/W; bitpos: [5]; default: 0;
         *  Configures hp_usbdevice registers write permission in ree0 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree0_hp_usbdevice:1;
        /** write_ree1_hp_usbdevice : R/W; bitpos: [6]; default: 0;
         *  Configures hp_usbdevice registers write permission in ree1 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree1_hp_usbdevice:1;
        /** write_ree2_hp_usbdevice : R/W; bitpos: [7]; default: 0;
         *  Configures hp_usbdevice registers write permission in ree2 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree2_hp_usbdevice:1;
        /** hp_usbdevice_lock : R/W; bitpos: [8]; default: 0;
         *  Set 1 to lock hp_usbdevice peri_apm configuration
         */
        uint32_t hp_usbdevice_lock:1;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} hp_peri1_pms_hp_usbdevice_ctrl_reg_t;

