espressif/esp-idf/components/soc/esp32s31/register/soc/hp_peri1_pms_struct.h
/** Type of hp_twai1_ctrl register
 *  hp_twai1 read/write control register
 */
typedef union {
    struct {
        /** read_tee_hp_twai1 : R/W; bitpos: [0]; default: 1;
         *  Configures hp_twai1 registers read permission in tee mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_tee_hp_twai1:1;
        /** read_ree0_hp_twai1 : R/W; bitpos: [1]; default: 0;
         *  Configures hp_twai1 registers read permission in ree0 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree0_hp_twai1:1;
        /** read_ree1_hp_twai1 : R/W; bitpos: [2]; default: 0;
         *  Configures hp_twai1 registers read permission in ree1 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree1_hp_twai1:1;
        /** read_ree2_hp_twai1 : R/W; bitpos: [3]; default: 0;
         *  Configures hp_twai1 registers read permission in ree2 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree2_hp_twai1:1;
        /** write_tee_hp_twai1 : R/W; bitpos: [4]; default: 1;
         *  Configures hp_twai1 registers write permission in tee mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_tee_hp_twai1:1;
        /** write_ree0_hp_twai1 : R/W; bitpos: [5]; default: 0;
         *  Configures hp_twai1 registers write permission in ree0 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree0_hp_twai1:1;
        /** write_ree1_hp_twai1 : R/W; bitpos: [6]; default: 0;
         *  Configures hp_twai1 registers write permission in ree1 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree1_hp_twai1:1;
        /** write_ree2_hp_twai1 : R/W; bitpos: [7]; default: 0;
         *  Configures hp_twai1 registers write permission in ree2 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree2_hp_twai1:1;
        /** hp_twai1_lock : R/W; bitpos: [8]; default: 0;
         *  Set 1 to lock hp_twai1 peri_apm configuration
         */
        uint32_t hp_twai1_lock:1;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} hp_peri1_pms_hp_twai1_ctrl_reg_t;

/** Type of hp_lcdcam_ctrl register
 *  hp_lcdcam read/write control register
 */
typedef union {
    struct {
        /** read_tee_hp_lcdcam : R/W; bitpos: [0]; default: 1;
         *  Configures hp_lcdcam registers read permission in tee mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_tee_hp_lcdcam:1;
        /** read_ree0_hp_lcdcam : R/W; bitpos: [1]; default: 0;
         *  Configures hp_lcdcam registers read permission in ree0 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree0_hp_lcdcam:1;
        /** read_ree1_hp_lcdcam : R/W; bitpos: [2]; default: 0;
         *  Configures hp_lcdcam registers read permission in ree1 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree1_hp_lcdcam:1;
        /** read_ree2_hp_lcdcam : R/W; bitpos: [3]; default: 0;
         *  Configures hp_lcdcam registers read permission in ree2 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree2_hp_lcdcam:1;
        /** write_tee_hp_lcdcam : R/W; bitpos: [4]; default: 1;
         *  Configures hp_lcdcam registers write permission in tee mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_tee_hp_lcdcam:1;
        /** write_ree0_hp_lcdcam : R/W; bitpos: [5]; default: 0;
         *  Configures hp_lcdcam registers write permission in ree0 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree0_hp_lcdcam:1;
        /** write_ree1_hp_lcdcam : R/W; bitpos: [6]; default: 0;
         *  Configures hp_lcdcam registers write permission in ree1 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree1_hp_lcdcam:1;
        /** write_ree2_hp_lcdcam : R/W; bitpos: [7]; default: 0;
         *  Configures hp_lcdcam registers write permission in ree2 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree2_hp_lcdcam:1;
        /** hp_lcdcam_lock : R/W; bitpos: [8]; default: 0;
         *  Set 1 to lock hp_lcdcam peri_apm configuration
         */
        uint32_t hp_lcdcam_lock:1;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} hp_peri1_pms_hp_lcdcam_ctrl_reg_t;

/** Type of hp_uhci_ctrl register
 *  hp_uhci read/write control register
 */
typedef union {
    struct {
        /** read_tee_hp_uhci : R/W; bitpos: [0]; default: 1;
         *  Configures hp_uhci registers read permission in tee mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_tee_hp_uhci:1;
        /** read_ree0_hp_uhci : R/W; bitpos: [1]; default: 0;
         *  Configures hp_uhci registers read permission in ree0 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree0_hp_uhci:1;
        /** read_ree1_hp_uhci : R/W; bitpos: [2]; default: 0;
         *  Configures hp_uhci registers read permission in ree1 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree1_hp_uhci:1;
        /** read_ree2_hp_uhci : R/W; bitpos: [3]; default: 0;
         *  Configures hp_uhci registers read permission in ree2 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree2_hp_uhci:1;
        /** write_tee_hp_uhci : R/W; bitpos: [4]; default: 1;
         *  Configures hp_uhci registers write permission in tee mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_tee_hp_uhci:1;
        /** write_ree0_hp_uhci : R/W; bitpos: [5]; default: 0;
         *  Configures hp_uhci registers write permission in ree0 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree0_hp_uhci:1;
        /** write_ree1_hp_uhci : R/W; bitpos: [6]; default: 0;
         *  Configures hp_uhci registers write permission in ree1 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree1_hp_uhci:1;
        /** write_ree2_hp_uhci : R/W; bitpos: [7]; default: 0;
         *  Configures hp_uhci registers write permission in ree2 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree2_hp_uhci:1;
        /** hp_uhci_lock : R/W; bitpos: [8]; default: 0;
         *  Set 1 to lock hp_uhci peri_apm configuration
         */
        uint32_t hp_uhci_lock:1;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} hp_peri1_pms_hp_uhci_ctrl_reg_t;

