espressif/esp-idf/components/soc/esp32s31/register/soc/hp_peri1_pms_struct.h
/** Type of hp_systimer_ctrl register
 *  hp_systimer read/write control register
 */
typedef union {
    struct {
        /** read_tee_hp_systimer : R/W; bitpos: [0]; default: 1;
         *  Configures hp_systimer registers read permission in tee mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_tee_hp_systimer:1;
        /** read_ree0_hp_systimer : R/W; bitpos: [1]; default: 0;
         *  Configures hp_systimer registers read permission in ree0 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree0_hp_systimer:1;
        /** read_ree1_hp_systimer : R/W; bitpos: [2]; default: 0;
         *  Configures hp_systimer registers read permission in ree1 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree1_hp_systimer:1;
        /** read_ree2_hp_systimer : R/W; bitpos: [3]; default: 0;
         *  Configures hp_systimer registers read permission in ree2 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree2_hp_systimer:1;
        /** write_tee_hp_systimer : R/W; bitpos: [4]; default: 1;
         *  Configures hp_systimer registers write permission in tee mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_tee_hp_systimer:1;
        /** write_ree0_hp_systimer : R/W; bitpos: [5]; default: 0;
         *  Configures hp_systimer registers write permission in ree0 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree0_hp_systimer:1;
        /** write_ree1_hp_systimer : R/W; bitpos: [6]; default: 0;
         *  Configures hp_systimer registers write permission in ree1 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree1_hp_systimer:1;
        /** write_ree2_hp_systimer : R/W; bitpos: [7]; default: 0;
         *  Configures hp_systimer registers write permission in ree2 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree2_hp_systimer:1;
        /** hp_systimer_lock : R/W; bitpos: [8]; default: 0;
         *  Set 1 to lock hp_systimer peri_apm configuration
         */
        uint32_t hp_systimer_lock:1;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} hp_peri1_pms_hp_systimer_ctrl_reg_t;

/** Type of hp_zero_det_ctrl register
 *  hp_zero_det read/write control register
 */
typedef union {
    struct {
        /** read_tee_hp_zero_det : R/W; bitpos: [0]; default: 1;
         *  Configures hp_zero_det registers read permission in tee mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_tee_hp_zero_det:1;
        /** read_ree0_hp_zero_det : R/W; bitpos: [1]; default: 0;
         *  Configures hp_zero_det registers read permission in ree0 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree0_hp_zero_det:1;
        /** read_ree1_hp_zero_det : R/W; bitpos: [2]; default: 0;
         *  Configures hp_zero_det registers read permission in ree1 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree1_hp_zero_det:1;
        /** read_ree2_hp_zero_det : R/W; bitpos: [3]; default: 0;
         *  Configures hp_zero_det registers read permission in ree2 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree2_hp_zero_det:1;
        /** write_tee_hp_zero_det : R/W; bitpos: [4]; default: 1;
         *  Configures hp_zero_det registers write permission in tee mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_tee_hp_zero_det:1;
        /** write_ree0_hp_zero_det : R/W; bitpos: [5]; default: 0;
         *  Configures hp_zero_det registers write permission in ree0 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree0_hp_zero_det:1;
        /** write_ree1_hp_zero_det : R/W; bitpos: [6]; default: 0;
         *  Configures hp_zero_det registers write permission in ree1 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree1_hp_zero_det:1;
        /** write_ree2_hp_zero_det : R/W; bitpos: [7]; default: 0;
         *  Configures hp_zero_det registers write permission in ree2 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree2_hp_zero_det:1;
        /** hp_zero_det_lock : R/W; bitpos: [8]; default: 0;
         *  Set 1 to lock hp_zero_det peri_apm configuration
         */
        uint32_t hp_zero_det_lock:1;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} hp_peri1_pms_hp_zero_det_ctrl_reg_t;

/** Type of hp_cordic_ctrl register
 *  hp_cordic read/write control register
 */
typedef union {
    struct {
        /** read_tee_hp_cordic : R/W; bitpos: [0]; default: 1;
         *  Configures hp_cordic registers read permission in tee mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_tee_hp_cordic:1;
        /** read_ree0_hp_cordic : R/W; bitpos: [1]; default: 0;
         *  Configures hp_cordic registers read permission in ree0 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree0_hp_cordic:1;
        /** read_ree1_hp_cordic : R/W; bitpos: [2]; default: 0;
         *  Configures hp_cordic registers read permission in ree1 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree1_hp_cordic:1;
        /** read_ree2_hp_cordic : R/W; bitpos: [3]; default: 0;
         *  Configures hp_cordic registers read permission in ree2 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree2_hp_cordic:1;
        /** write_tee_hp_cordic : R/W; bitpos: [4]; default: 1;
         *  Configures hp_cordic registers write permission in tee mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_tee_hp_cordic:1;
        /** write_ree0_hp_cordic : R/W; bitpos: [5]; default: 0;
         *  Configures hp_cordic registers write permission in ree0 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree0_hp_cordic:1;
        /** write_ree1_hp_cordic : R/W; bitpos: [6]; default: 0;
         *  Configures hp_cordic registers write permission in ree1 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree1_hp_cordic:1;
        /** write_ree2_hp_cordic : R/W; bitpos: [7]; default: 0;
         *  Configures hp_cordic registers write permission in ree2 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree2_hp_cordic:1;
        /** hp_cordic_lock : R/W; bitpos: [8]; default: 0;
         *  Set 1 to lock hp_cordic peri_apm configuration
         */
        uint32_t hp_cordic_lock:1;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} hp_peri1_pms_hp_cordic_ctrl_reg_t;

