espressif/esp-idf/components/soc/esp32s31/register/soc/hp_peri1_pms_struct.h
/** Type of hp_ledc1_ctrl register
 *  hp_ledc1 read/write control register
 */
typedef union {
    struct {
        /** read_tee_hp_ledc1 : R/W; bitpos: [0]; default: 1;
         *  Configures hp_ledc1 registers read permission in tee mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_tee_hp_ledc1:1;
        /** read_ree0_hp_ledc1 : R/W; bitpos: [1]; default: 0;
         *  Configures hp_ledc1 registers read permission in ree0 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree0_hp_ledc1:1;
        /** read_ree1_hp_ledc1 : R/W; bitpos: [2]; default: 0;
         *  Configures hp_ledc1 registers read permission in ree1 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree1_hp_ledc1:1;
        /** read_ree2_hp_ledc1 : R/W; bitpos: [3]; default: 0;
         *  Configures hp_ledc1 registers read permission in ree2 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree2_hp_ledc1:1;
        /** write_tee_hp_ledc1 : R/W; bitpos: [4]; default: 1;
         *  Configures hp_ledc1 registers write permission in tee mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_tee_hp_ledc1:1;
        /** write_ree0_hp_ledc1 : R/W; bitpos: [5]; default: 0;
         *  Configures hp_ledc1 registers write permission in ree0 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree0_hp_ledc1:1;
        /** write_ree1_hp_ledc1 : R/W; bitpos: [6]; default: 0;
         *  Configures hp_ledc1 registers write permission in ree1 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree1_hp_ledc1:1;
        /** write_ree2_hp_ledc1 : R/W; bitpos: [7]; default: 0;
         *  Configures hp_ledc1 registers write permission in ree2 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree2_hp_ledc1:1;
        /** hp_ledc1_lock : R/W; bitpos: [8]; default: 0;
         *  Set 1 to lock hp_ledc1 peri_apm configuration
         */
        uint32_t hp_ledc1_lock:1;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} hp_peri1_pms_hp_ledc1_ctrl_reg_t;

/** Type of hp_pcnt1_ctrl register
 *  hp_pcnt1 read/write control register
 */
typedef union {
    struct {
        /** read_tee_hp_pcnt1 : R/W; bitpos: [0]; default: 1;
         *  Configures hp_pcnt1 registers read permission in tee mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_tee_hp_pcnt1:1;
        /** read_ree0_hp_pcnt1 : R/W; bitpos: [1]; default: 0;
         *  Configures hp_pcnt1 registers read permission in ree0 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree0_hp_pcnt1:1;
        /** read_ree1_hp_pcnt1 : R/W; bitpos: [2]; default: 0;
         *  Configures hp_pcnt1 registers read permission in ree1 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree1_hp_pcnt1:1;
        /** read_ree2_hp_pcnt1 : R/W; bitpos: [3]; default: 0;
         *  Configures hp_pcnt1 registers read permission in ree2 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree2_hp_pcnt1:1;
        /** write_tee_hp_pcnt1 : R/W; bitpos: [4]; default: 1;
         *  Configures hp_pcnt1 registers write permission in tee mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_tee_hp_pcnt1:1;
        /** write_ree0_hp_pcnt1 : R/W; bitpos: [5]; default: 0;
         *  Configures hp_pcnt1 registers write permission in ree0 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree0_hp_pcnt1:1;
        /** write_ree1_hp_pcnt1 : R/W; bitpos: [6]; default: 0;
         *  Configures hp_pcnt1 registers write permission in ree1 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree1_hp_pcnt1:1;
        /** write_ree2_hp_pcnt1 : R/W; bitpos: [7]; default: 0;
         *  Configures hp_pcnt1 registers write permission in ree2 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree2_hp_pcnt1:1;
        /** hp_pcnt1_lock : R/W; bitpos: [8]; default: 0;
         *  Set 1 to lock hp_pcnt1 peri_apm configuration
         */
        uint32_t hp_pcnt1_lock:1;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} hp_peri1_pms_hp_pcnt1_ctrl_reg_t;

/** Type of hp_timer_group0_ctrl register
 *  hp_timer_group0 read/write control register
 */
typedef union {
    struct {
        /** read_tee_hp_timer_group0 : R/W; bitpos: [0]; default: 1;
         *  Configures hp_timer_group0 registers read permission in tee mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_tee_hp_timer_group0:1;
        /** read_ree0_hp_timer_group0 : R/W; bitpos: [1]; default: 0;
         *  Configures hp_timer_group0 registers read permission in ree0 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree0_hp_timer_group0:1;
        /** read_ree1_hp_timer_group0 : R/W; bitpos: [2]; default: 0;
         *  Configures hp_timer_group0 registers read permission in ree1 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree1_hp_timer_group0:1;
        /** read_ree2_hp_timer_group0 : R/W; bitpos: [3]; default: 0;
         *  Configures hp_timer_group0 registers read permission in ree2 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree2_hp_timer_group0:1;
        /** write_tee_hp_timer_group0 : R/W; bitpos: [4]; default: 1;
         *  Configures hp_timer_group0 registers write permission in tee mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_tee_hp_timer_group0:1;
        /** write_ree0_hp_timer_group0 : R/W; bitpos: [5]; default: 0;
         *  Configures hp_timer_group0 registers write permission in ree0 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree0_hp_timer_group0:1;
        /** write_ree1_hp_timer_group0 : R/W; bitpos: [6]; default: 0;
         *  Configures hp_timer_group0 registers write permission in ree1 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree1_hp_timer_group0:1;
        /** write_ree2_hp_timer_group0 : R/W; bitpos: [7]; default: 0;
         *  Configures hp_timer_group0 registers write permission in ree2 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree2_hp_timer_group0:1;
        /** hp_timer_group0_lock : R/W; bitpos: [8]; default: 0;
         *  Set 1 to lock hp_timer_group0 peri_apm configuration
         */
        uint32_t hp_timer_group0_lock:1;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} hp_peri1_pms_hp_timer_group0_ctrl_reg_t;

/** Type of hp_timer_group1_ctrl register
 *  hp_timer_group1 read/write control register
 */
typedef union {
    struct {
        /** read_tee_hp_timer_group1 : R/W; bitpos: [0]; default: 1;
         *  Configures hp_timer_group1 registers read permission in tee mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_tee_hp_timer_group1:1;
        /** read_ree0_hp_timer_group1 : R/W; bitpos: [1]; default: 0;
         *  Configures hp_timer_group1 registers read permission in ree0 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree0_hp_timer_group1:1;
        /** read_ree1_hp_timer_group1 : R/W; bitpos: [2]; default: 0;
         *  Configures hp_timer_group1 registers read permission in ree1 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree1_hp_timer_group1:1;
        /** read_ree2_hp_timer_group1 : R/W; bitpos: [3]; default: 0;
         *  Configures hp_timer_group1 registers read permission in ree2 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree2_hp_timer_group1:1;
        /** write_tee_hp_timer_group1 : R/W; bitpos: [4]; default: 1;
         *  Configures hp_timer_group1 registers write permission in tee mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_tee_hp_timer_group1:1;
        /** write_ree0_hp_timer_group1 : R/W; bitpos: [5]; default: 0;
         *  Configures hp_timer_group1 registers write permission in ree0 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree0_hp_timer_group1:1;
        /** write_ree1_hp_timer_group1 : R/W; bitpos: [6]; default: 0;
         *  Configures hp_timer_group1 registers write permission in ree1 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree1_hp_timer_group1:1;
        /** write_ree2_hp_timer_group1 : R/W; bitpos: [7]; default: 0;
         *  Configures hp_timer_group1 registers write permission in ree2 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree2_hp_timer_group1:1;
        /** hp_timer_group1_lock : R/W; bitpos: [8]; default: 0;
         *  Set 1 to lock hp_timer_group1 peri_apm configuration
         */
        uint32_t hp_timer_group1_lock:1;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} hp_peri1_pms_hp_timer_group1_ctrl_reg_t;

