espressif/esp-idf/components/soc/esp32s31/register/soc/hp_peri1_pms_struct.h
/** Type of hp_iomux_ctrl register
 *  hp_iomux read/write control register
 */
typedef union {
    struct {
        /** read_tee_hp_iomux : R/W; bitpos: [0]; default: 1;
         *  Configures hp_iomux registers read permission in tee mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_tee_hp_iomux:1;
        /** read_ree0_hp_iomux : R/W; bitpos: [1]; default: 0;
         *  Configures hp_iomux registers read permission in ree0 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree0_hp_iomux:1;
        /** read_ree1_hp_iomux : R/W; bitpos: [2]; default: 0;
         *  Configures hp_iomux registers read permission in ree1 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree1_hp_iomux:1;
        /** read_ree2_hp_iomux : R/W; bitpos: [3]; default: 0;
         *  Configures hp_iomux registers read permission in ree2 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree2_hp_iomux:1;
        /** write_tee_hp_iomux : R/W; bitpos: [4]; default: 1;
         *  Configures hp_iomux registers write permission in tee mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_tee_hp_iomux:1;
        /** write_ree0_hp_iomux : R/W; bitpos: [5]; default: 0;
         *  Configures hp_iomux registers write permission in ree0 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree0_hp_iomux:1;
        /** write_ree1_hp_iomux : R/W; bitpos: [6]; default: 0;
         *  Configures hp_iomux registers write permission in ree1 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree1_hp_iomux:1;
        /** write_ree2_hp_iomux : R/W; bitpos: [7]; default: 0;
         *  Configures hp_iomux registers write permission in ree2 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree2_hp_iomux:1;
        /** hp_iomux_lock : R/W; bitpos: [8]; default: 0;
         *  Set 1 to lock hp_iomux peri_apm configuration
         */
        uint32_t hp_iomux_lock:1;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} hp_peri1_pms_hp_iomux_ctrl_reg_t;

/** Type of hp_mspi_padctrl_ctrl register
 *  hp_mspi_padctrl read/write control register
 */
typedef union {
    struct {
        /** read_tee_hp_mspi_padctrl : R/W; bitpos: [0]; default: 1;
         *  Configures hp_mspi_padctrl registers read permission in tee mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_tee_hp_mspi_padctrl:1;
        /** read_ree0_hp_mspi_padctrl : R/W; bitpos: [1]; default: 0;
         *  Configures hp_mspi_padctrl registers read permission in ree0 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree0_hp_mspi_padctrl:1;
        /** read_ree1_hp_mspi_padctrl : R/W; bitpos: [2]; default: 0;
         *  Configures hp_mspi_padctrl registers read permission in ree1 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree1_hp_mspi_padctrl:1;
        /** read_ree2_hp_mspi_padctrl : R/W; bitpos: [3]; default: 0;
         *  Configures hp_mspi_padctrl registers read permission in ree2 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree2_hp_mspi_padctrl:1;
        /** write_tee_hp_mspi_padctrl : R/W; bitpos: [4]; default: 1;
         *  Configures hp_mspi_padctrl registers write permission in tee mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_tee_hp_mspi_padctrl:1;
        /** write_ree0_hp_mspi_padctrl : R/W; bitpos: [5]; default: 0;
         *  Configures hp_mspi_padctrl registers write permission in ree0 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree0_hp_mspi_padctrl:1;
        /** write_ree1_hp_mspi_padctrl : R/W; bitpos: [6]; default: 0;
         *  Configures hp_mspi_padctrl registers write permission in ree1 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree1_hp_mspi_padctrl:1;
        /** write_ree2_hp_mspi_padctrl : R/W; bitpos: [7]; default: 0;
         *  Configures hp_mspi_padctrl registers write permission in ree2 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree2_hp_mspi_padctrl:1;
        /** hp_mspi_padctrl_lock : R/W; bitpos: [8]; default: 0;
         *  Set 1 to lock hp_mspi_padctrl peri_apm configuration
         */
        uint32_t hp_mspi_padctrl_lock:1;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} hp_peri1_pms_hp_mspi_padctrl_ctrl_reg_t;

/** Type of hp_intrmtx_ctrl register
 *  hp_intrmtx read/write control register
 */
typedef union {
    struct {
        /** read_tee_hp_intrmtx : R/W; bitpos: [0]; default: 1;
         *  Configures hp_intrmtx registers read permission in tee mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_tee_hp_intrmtx:1;
        /** read_ree0_hp_intrmtx : R/W; bitpos: [1]; default: 0;
         *  Configures hp_intrmtx registers read permission in ree0 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree0_hp_intrmtx:1;
        /** read_ree1_hp_intrmtx : R/W; bitpos: [2]; default: 0;
         *  Configures hp_intrmtx registers read permission in ree1 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree1_hp_intrmtx:1;
        /** read_ree2_hp_intrmtx : R/W; bitpos: [3]; default: 0;
         *  Configures hp_intrmtx registers read permission in ree2 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree2_hp_intrmtx:1;
        /** write_tee_hp_intrmtx : R/W; bitpos: [4]; default: 1;
         *  Configures hp_intrmtx registers write permission in tee mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_tee_hp_intrmtx:1;
        /** write_ree0_hp_intrmtx : R/W; bitpos: [5]; default: 0;
         *  Configures hp_intrmtx registers write permission in ree0 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree0_hp_intrmtx:1;
        /** write_ree1_hp_intrmtx : R/W; bitpos: [6]; default: 0;
         *  Configures hp_intrmtx registers write permission in ree1 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree1_hp_intrmtx:1;
        /** write_ree2_hp_intrmtx : R/W; bitpos: [7]; default: 0;
         *  Configures hp_intrmtx registers write permission in ree2 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree2_hp_intrmtx:1;
        /** hp_intrmtx_lock : R/W; bitpos: [8]; default: 0;
         *  Set 1 to lock hp_intrmtx peri_apm configuration
         */
        uint32_t hp_intrmtx_lock:1;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} hp_peri1_pms_hp_intrmtx_ctrl_reg_t;

