espressif/esp-idf/components/soc/esp32s31/register/soc/hp_peri1_pms_struct.h
/** Type of hp_sys_reg_ctrl register
 *  hp_sys_reg read/write control register
 */
typedef union {
    struct {
        /** read_tee_hp_sys_reg : R/W; bitpos: [0]; default: 1;
         *  Configures hp_sys_reg registers read permission in tee mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_tee_hp_sys_reg:1;
        /** read_ree0_hp_sys_reg : R/W; bitpos: [1]; default: 0;
         *  Configures hp_sys_reg registers read permission in ree0 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree0_hp_sys_reg:1;
        /** read_ree1_hp_sys_reg : R/W; bitpos: [2]; default: 0;
         *  Configures hp_sys_reg registers read permission in ree1 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree1_hp_sys_reg:1;
        /** read_ree2_hp_sys_reg : R/W; bitpos: [3]; default: 0;
         *  Configures hp_sys_reg registers read permission in ree2 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree2_hp_sys_reg:1;
        /** write_tee_hp_sys_reg : R/W; bitpos: [4]; default: 1;
         *  Configures hp_sys_reg registers write permission in tee mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_tee_hp_sys_reg:1;
        /** write_ree0_hp_sys_reg : R/W; bitpos: [5]; default: 0;
         *  Configures hp_sys_reg registers write permission in ree0 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree0_hp_sys_reg:1;
        /** write_ree1_hp_sys_reg : R/W; bitpos: [6]; default: 0;
         *  Configures hp_sys_reg registers write permission in ree1 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree1_hp_sys_reg:1;
        /** write_ree2_hp_sys_reg : R/W; bitpos: [7]; default: 0;
         *  Configures hp_sys_reg registers write permission in ree2 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree2_hp_sys_reg:1;
        /** hp_sys_reg_lock : R/W; bitpos: [8]; default: 0;
         *  Set 1 to lock hp_sys_reg peri_apm configuration
         */
        uint32_t hp_sys_reg_lock:1;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} hp_peri1_pms_hp_sys_reg_ctrl_reg_t;

/** Type of hp_clkrst_ctrl register
 *  hp_clkrst read/write control register
 */
typedef union {
    struct {
        /** read_tee_hp_clkrst : R/W; bitpos: [0]; default: 1;
         *  Configures hp_clkrst registers read permission in tee mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_tee_hp_clkrst:1;
        /** read_ree0_hp_clkrst : R/W; bitpos: [1]; default: 0;
         *  Configures hp_clkrst registers read permission in ree0 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree0_hp_clkrst:1;
        /** read_ree1_hp_clkrst : R/W; bitpos: [2]; default: 0;
         *  Configures hp_clkrst registers read permission in ree1 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree1_hp_clkrst:1;
        /** read_ree2_hp_clkrst : R/W; bitpos: [3]; default: 0;
         *  Configures hp_clkrst registers read permission in ree2 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree2_hp_clkrst:1;
        /** write_tee_hp_clkrst : R/W; bitpos: [4]; default: 1;
         *  Configures hp_clkrst registers write permission in tee mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_tee_hp_clkrst:1;
        /** write_ree0_hp_clkrst : R/W; bitpos: [5]; default: 0;
         *  Configures hp_clkrst registers write permission in ree0 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree0_hp_clkrst:1;
        /** write_ree1_hp_clkrst : R/W; bitpos: [6]; default: 0;
         *  Configures hp_clkrst registers write permission in ree1 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree1_hp_clkrst:1;
        /** write_ree2_hp_clkrst : R/W; bitpos: [7]; default: 0;
         *  Configures hp_clkrst registers write permission in ree2 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree2_hp_clkrst:1;
        /** hp_clkrst_lock : R/W; bitpos: [8]; default: 0;
         *  Set 1 to lock hp_clkrst peri_apm configuration
         */
        uint32_t hp_clkrst_lock:1;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} hp_peri1_pms_hp_clkrst_ctrl_reg_t;

/** Type of cnnt_pad_ctrl_ctrl register
 *  cnnt_pad_ctrl read/write control register
 */
typedef union {
    struct {
        /** read_tee_cnnt_pad_ctrl : R/W; bitpos: [0]; default: 1;
         *  Configures cnnt_pad_ctrl registers read permission in tee mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_tee_cnnt_pad_ctrl:1;
        /** read_ree0_cnnt_pad_ctrl : R/W; bitpos: [1]; default: 0;
         *  Configures cnnt_pad_ctrl registers read permission in ree0 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree0_cnnt_pad_ctrl:1;
        /** read_ree1_cnnt_pad_ctrl : R/W; bitpos: [2]; default: 0;
         *  Configures cnnt_pad_ctrl registers read permission in ree1 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree1_cnnt_pad_ctrl:1;
        /** read_ree2_cnnt_pad_ctrl : R/W; bitpos: [3]; default: 0;
         *  Configures cnnt_pad_ctrl registers read permission in ree2 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree2_cnnt_pad_ctrl:1;
        /** write_tee_cnnt_pad_ctrl : R/W; bitpos: [4]; default: 1;
         *  Configures cnnt_pad_ctrl registers write permission in tee mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_tee_cnnt_pad_ctrl:1;
        /** write_ree0_cnnt_pad_ctrl : R/W; bitpos: [5]; default: 0;
         *  Configures cnnt_pad_ctrl registers write permission in ree0 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree0_cnnt_pad_ctrl:1;
        /** write_ree1_cnnt_pad_ctrl : R/W; bitpos: [6]; default: 0;
         *  Configures cnnt_pad_ctrl registers write permission in ree1 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree1_cnnt_pad_ctrl:1;
        /** write_ree2_cnnt_pad_ctrl : R/W; bitpos: [7]; default: 0;
         *  Configures cnnt_pad_ctrl registers write permission in ree2 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree2_cnnt_pad_ctrl:1;
        /** cnnt_pad_ctrl_lock : R/W; bitpos: [8]; default: 0;
         *  Set 1 to lock cnnt_pad_ctrl peri_apm configuration
         */
        uint32_t cnnt_pad_ctrl_lock:1;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} hp_peri1_pms_cnnt_pad_ctrl_ctrl_reg_t;

/** Type of hp_alive_sys_reg_ctrl register
 *  hp_alive_sys_reg read/write control register
 */
typedef union {
    struct {
        /** read_tee_hp_alive_sys_reg : R/W; bitpos: [0]; default: 1;
         *  Configures hp_alive_sys_reg registers read permission in tee mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_tee_hp_alive_sys_reg:1;
        /** read_ree0_hp_alive_sys_reg : R/W; bitpos: [1]; default: 0;
         *  Configures hp_alive_sys_reg registers read permission in ree0 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree0_hp_alive_sys_reg:1;
        /** read_ree1_hp_alive_sys_reg : R/W; bitpos: [2]; default: 0;
         *  Configures hp_alive_sys_reg registers read permission in ree1 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree1_hp_alive_sys_reg:1;
        /** read_ree2_hp_alive_sys_reg : R/W; bitpos: [3]; default: 0;
         *  Configures hp_alive_sys_reg registers read permission in ree2 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree2_hp_alive_sys_reg:1;
        /** write_tee_hp_alive_sys_reg : R/W; bitpos: [4]; default: 1;
         *  Configures hp_alive_sys_reg registers write permission in tee mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_tee_hp_alive_sys_reg:1;
        /** write_ree0_hp_alive_sys_reg : R/W; bitpos: [5]; default: 0;
         *  Configures hp_alive_sys_reg registers write permission in ree0 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree0_hp_alive_sys_reg:1;
        /** write_ree1_hp_alive_sys_reg : R/W; bitpos: [6]; default: 0;
         *  Configures hp_alive_sys_reg registers write permission in ree1 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree1_hp_alive_sys_reg:1;
        /** write_ree2_hp_alive_sys_reg : R/W; bitpos: [7]; default: 0;
         *  Configures hp_alive_sys_reg registers write permission in ree2 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree2_hp_alive_sys_reg:1;
        /** hp_alive_sys_reg_lock : R/W; bitpos: [8]; default: 0;
         *  Set 1 to lock hp_alive_sys_reg peri_apm configuration
         */
        uint32_t hp_alive_sys_reg_lock:1;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} hp_peri1_pms_hp_alive_sys_reg_ctrl_reg_t;

