espressif/esp-idf/components/soc/esp32s31/register/soc/hp_peri1_pms_struct.h
/** Type of hp_peri1_pms_ctrl register
 *  hp_peri1_pms read/write control register
 */
typedef union {
    struct {
        /** read_tee_hp_peri1_pms : R/W; bitpos: [0]; default: 1;
         *  Configures hp_peri1_pms registers read permission in tee mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_tee_hp_peri1_pms:1;
        /** read_ree0_hp_peri1_pms : HRO; bitpos: [1]; default: 0;
         *  Configures hp_peri1_pms registers read permission in ree0 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree0_hp_peri1_pms:1;
        /** read_ree1_hp_peri1_pms : HRO; bitpos: [2]; default: 0;
         *  Configures hp_peri1_pms registers read permission in ree1 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree1_hp_peri1_pms:1;
        /** read_ree2_hp_peri1_pms : HRO; bitpos: [3]; default: 0;
         *  Configures hp_peri1_pms registers read permission in ree2 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree2_hp_peri1_pms:1;
        /** write_tee_hp_peri1_pms : R/W; bitpos: [4]; default: 1;
         *  Configures hp_peri1_pms registers write permission in tee mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_tee_hp_peri1_pms:1;
        /** write_ree0_hp_peri1_pms : HRO; bitpos: [5]; default: 0;
         *  Configures hp_peri1_pms registers write permission in ree0 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree0_hp_peri1_pms:1;
        /** write_ree1_hp_peri1_pms : HRO; bitpos: [6]; default: 0;
         *  Configures hp_peri1_pms registers write permission in ree1 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree1_hp_peri1_pms:1;
        /** write_ree2_hp_peri1_pms : HRO; bitpos: [7]; default: 0;
         *  Configures hp_peri1_pms registers write permission in ree2 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree2_hp_peri1_pms:1;
        /** hp_peri1_pms_lock : R/W; bitpos: [8]; default: 0;
         *  Set 1 to lock hp_peri1_pms peri_apm configuration
         */
        uint32_t hp_peri1_pms_lock:1;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} hp_peri1_pms_hp_peri1_pms_ctrl_reg_t;


/** Group: PMS Register */
/** Type of hp_peri1_0 register
 *  HP_PERI1 PMS configuration & info register
 */
typedef union {
    struct {
        /** hp_peri1_pms_exception_clr : WT; bitpos: [0]; default: 0;
         *  Configures whether or not to clear hp_peri1 peri_pms_record_reg.
         *  0: No clear
         *  1: Clear peri_pms_record_reg
         */
        uint32_t hp_peri1_pms_exception_clr:1;
        /** hp_peri1_pms_exception_det : RO; bitpos: [1]; default: 0;
         *  Represents whether the hp_peri1 pms has been triggered.
         *  0: No triggered
         *  1: Has been triggered
         */
        uint32_t hp_peri1_pms_exception_det:1;
        /** hp_peri1_pms_exception_id : RO; bitpos: [7:2]; default: 0;
         *  Represents the master id when hp_peri1 pms has been triggered.
         */
        uint32_t hp_peri1_pms_exception_id:6;
        /** hp_peri1_pms_exception_mode : RO; bitpos: [9:8]; default: 0;
         *  Represents the security mode when hp_peri1 pms has been triggered.
         */
        uint32_t hp_peri1_pms_exception_mode:2;
        uint32_t reserved_10:22;
    };
    uint32_t val;
} hp_peri1_pms_hp_peri1_0_reg_t;

/** Type of hp_peri1_1 register
 *  HP_PERI1 PMS exception addr record register
 */
typedef union {
    struct {
        /** hp_peri1_pms_exception_addr : RO; bitpos: [27:0]; default: 0;
         *  Represents the access address (bit27~bit0) when hp_peri1 pms has been triggered.
         */
        uint32_t hp_peri1_pms_exception_addr:28;
        /** hp_peri1_pms_exception_addr_const : HRO; bitpos: [31:28]; default: 2;
         *  Represents the access address (bit31~bit28) when hp_peri1 pms has been triggered.
         */
        uint32_t hp_peri1_pms_exception_addr_const:4;
    };
    uint32_t val;
} hp_peri1_pms_hp_peri1_1_reg_t;

/** Type of int_en register
 *  APM interrupt enable register
 */
typedef union {
    struct {
        /** hp_peri1_pms_int_en : R/W; bitpos: [0]; default: 0;
         *  Configures to enable hp_peri1 pms interrupt.
         *  0: disable
         *  1: enable
         */
        uint32_t hp_peri1_pms_int_en:1;
        uint32_t reserved_1:31;
    };
    uint32_t val;
} hp_peri1_pms_int_en_reg_t;


/** Group: config register */
/** Type of bus_err_conf register
 *  Clock gating register
 */
typedef union {
    struct {
        /** bus_err_resp_en : R/W; bitpos: [0]; default: 0;
         *  Configures whether return error response to cpu when access blocked
         *  0: disable error response
         *  1: enable error response
         */
        uint32_t bus_err_resp_en:1;
        uint32_t reserved_1:31;
    };
    uint32_t val;
} hp_peri1_pms_bus_err_conf_reg_t;


/** Group: clock gating register */
/** Type of clock_gate register
 *  Clock gating register
 */
typedef union {
    struct {
        /** clk_en : R/W; bitpos: [0]; default: 1;
         *  Configures whether to keep the clock always on.
         *  0: enable automatic clock gating
         *  1: keep the clock always on
         */
        uint32_t clk_en:1;
        uint32_t reserved_1:31;
    };
    uint32_t val;
} hp_peri1_pms_clock_gate_reg_t;


/** Group: Version control register */
/** Type of date register
 *  Version control register
 */
typedef union {
    struct {
        /** date : R/W; bitpos: [27:0]; default: 38834720;
         *  Version control register
         */
        uint32_t date:28;
        uint32_t reserved_28:4;
    };
    uint32_t val;
} hp_peri1_pms_date_reg_t;


typedef struct {
    volatile hp_peri1_pms_hp_usbotg_phy_ctrl_reg_t hp_usbotg_phy_ctrl;
    volatile hp_peri1_pms_hp_mcpwm0_ctrl_reg_t hp_mcpwm0_ctrl;
    volatile hp_peri1_pms_hp_mcpwm1_ctrl_reg_t hp_mcpwm1_ctrl;
    volatile hp_peri1_pms_hp_mcpwm2_ctrl_reg_t hp_mcpwm2_ctrl;
    volatile hp_peri1_pms_hp_mcpwm3_ctrl_reg_t hp_mcpwm3_ctrl;
    volatile hp_peri1_pms_hp_i2c0_ctrl_reg_t hp_i2c0_ctrl;
    volatile hp_peri1_pms_hp_i2c1_ctrl_reg_t hp_i2c1_ctrl;
    volatile hp_peri1_pms_hp_i2s0_ctrl_reg_t hp_i2s0_ctrl;
    volatile hp_peri1_pms_hp_i2s1_ctrl_reg_t hp_i2s1_ctrl;
    volatile hp_peri1_pms_hp_pcnt0_ctrl_reg_t hp_pcnt0_ctrl;
    volatile hp_peri1_pms_hp_uart0_ctrl_reg_t hp_uart0_ctrl;
    volatile hp_peri1_pms_hp_uart1_ctrl_reg_t hp_uart1_ctrl;
    volatile hp_peri1_pms_hp_uart2_ctrl_reg_t hp_uart2_ctrl;
    volatile hp_peri1_pms_hp_uart3_ctrl_reg_t hp_uart3_ctrl;
    volatile hp_peri1_pms_hp_parlio_ctrl_reg_t hp_parlio_ctrl;
    volatile hp_peri1_pms_hp_gpspi2_ctrl_reg_t hp_gpspi2_ctrl;
    volatile hp_peri1_pms_hp_gpspi3_ctrl_reg_t hp_gpspi3_ctrl;
    volatile hp_peri1_pms_hp_usbdevice_ctrl_reg_t hp_usbdevice_ctrl;
    volatile hp_peri1_pms_hp_ledc0_ctrl_reg_t hp_ledc0_ctrl;
    volatile hp_peri1_pms_hp_etm_ctrl_reg_t hp_etm_ctrl;
    volatile hp_peri1_pms_hp_twai0_ctrl_reg_t hp_twai0_ctrl;
    volatile hp_peri1_pms_hp_twai1_ctrl_reg_t hp_twai1_ctrl;
    volatile hp_peri1_pms_hp_lcdcam_ctrl_reg_t hp_lcdcam_ctrl;
    volatile hp_peri1_pms_hp_uhci_ctrl_reg_t hp_uhci_ctrl;
    volatile hp_peri1_pms_hp_systimer_ctrl_reg_t hp_systimer_ctrl;
    volatile hp_peri1_pms_hp_zero_det_ctrl_reg_t hp_zero_det_ctrl;
    volatile hp_peri1_pms_hp_cordic_ctrl_reg_t hp_cordic_ctrl;
    volatile hp_peri1_pms_hp_ledc1_ctrl_reg_t hp_ledc1_ctrl;
    volatile hp_peri1_pms_hp_pcnt1_ctrl_reg_t hp_pcnt1_ctrl;
    volatile hp_peri1_pms_hp_timer_group0_ctrl_reg_t hp_timer_group0_ctrl;
    volatile hp_peri1_pms_hp_timer_group1_ctrl_reg_t hp_timer_group1_ctrl;
    volatile hp_peri1_pms_hp_iomux_ctrl_reg_t hp_iomux_ctrl;
    volatile hp_peri1_pms_hp_mspi_padctrl_ctrl_reg_t hp_mspi_padctrl_ctrl;
    volatile hp_peri1_pms_hp_intrmtx_ctrl_reg_t hp_intrmtx_ctrl;
    volatile hp_peri1_pms_hp_sys_reg_ctrl_reg_t hp_sys_reg_ctrl;
    volatile hp_peri1_pms_hp_clkrst_ctrl_reg_t hp_clkrst_ctrl;
    volatile hp_peri1_pms_cnnt_pad_ctrl_ctrl_reg_t cnnt_pad_ctrl_ctrl;
    volatile hp_peri1_pms_hp_alive_sys_reg_ctrl_reg_t hp_alive_sys_reg_ctrl;
    volatile hp_peri1_pms_hp_peri1_pms_ctrl_reg_t hp_peri1_pms_ctrl;
    uint32_t reserved_09c[89];
    volatile hp_peri1_pms_hp_peri1_0_reg_t hp_peri1_0;
    volatile hp_peri1_pms_hp_peri1_1_reg_t hp_peri1_1;
    uint32_t reserved_208[62];
    volatile hp_peri1_pms_int_en_reg_t int_en;
    uint32_t reserved_304[827];
    volatile hp_peri1_pms_bus_err_conf_reg_t bus_err_conf;
    uint32_t reserved_ff4;
    volatile hp_peri1_pms_clock_gate_reg_t clock_gate;
    volatile hp_peri1_pms_date_reg_t date;
} hp_peri1_pms_dev_t;


#ifndef __cplusplus
_Static_assert(sizeof(hp_peri1_pms_dev_t) == 0x1000, "Invalid size of hp_peri1_pms_dev_t structure");
#endif

#ifdef __cplusplus
}
#endif
